<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>La Cartografía: El Poder de Ver el Mundo</title>
    <link rel="stylesheet" href="css/mi_estilo.css">
</head>
<body>
    <header>
        <h1>La Cartograf&iacute;a: El Poder de Ver el Mundo</h1>
        <nav>
            <ul>
                <li><a href="#introduccion">Introducci&oacute;n</a></li>
                <li><a href="#historia">Historia</a></li>
                <li><a href="#elementos">Elementos del Mapa</a></li>
                <li><a href="#tipos">Tipos de Mapas</a></li>
                <li><a href="#interactivo">Mapa Interactivo</a></li>
            </ul>
        </nav>
    </header>

    <main>
        <section id="introduccion">
            <h2>&iquest;Qu&eacute; es la Cartograf&iacute;a?</h2>
            <p>La cartograf&iacute;a es la ciencia, el arte y la t&eacute;cnica de hacer mapas. Es una disciplina que combina la geograf&iacute;a, las matem&aacute;ticas, la inform&aacute;tica y el dise&ntilde;o para representar la superficie terrestre o partes de ella en un plano. Su objetivo principal es comunicar informaci&oacute;n espacial de manera clara y comprensible, permitiendo la visualizaci&oacute;n y an&aacute;lisis de datos geogr&aacute;ficos.</p>
            <p>Desde la antig&uuml;edad, los mapas han sido herramientas esenciales para la navegaci&oacute;n, la exploraci&oacute;n, la planificaci&oacute;n y la comprensi&oacute;n de nuestro mundo. Evolucionaron desde simples dibujos hasta complejos sistemas de informaci&oacute;n geogr&aacute;fica, adapt&aacute;ndose constantemente a las necesidades humanas y a los avances tecnol&oacute;gicos. Hoy en d&iacute;a, la cartograf&iacute;a es fundamental para la gesti&oacute;n de recursos naturales, el urbanismo, la log&iacute;stica y la respuesta a emergencias. Evolucionaron desde simples dibujos hasta complejos sistemas de informaci&oacute;n geogr&aacute;fica.</p>
        </section>

        <section id="historia">
            <h2>Historia de la Cartograf&iacute;a</h2>
            <p>La historia de la cartograf&iacute;a es tan antigua como la civilizaci&oacute;n misma. Los primeros mapas conocidos datan de miles de a&ntilde;os atr&aacute;s, grabados en tablillas de arcilla o pintados en paredes de cuevas, reflejando la necesidad humana de orientarse y registrar el territorio. Culturas como la egipcia, griega, romana y china desarrollaron sus propias t&eacute;cnicas cartogr&aacute;ficas, destacando la contribuci&oacute;n de los griegos con conceptos de esfericidad de la Tierra y sistemas de coordenadas. <strong>Ptolomeo</strong>, por ejemplo, fue una figura clave en la antig&uuml;edad con su obra "Geographia".</p>
            <p>El Renacimiento marc&oacute; un punto de inflexi&oacute;n decisivo con exploradores como <strong>Crist&oacute;bal Col&oacute;n</strong> y <strong>Ferdinand Magellan</strong>, cuyas grandes expediciones impulsaron dr&aacute;sticamente la necesidad de mapas m&aacute;s precisos y representaciones del mundo a una escala global. Este periodo vio el auge de la imprenta, que facilit&oacute; la difusi&oacute;n de mapas. Figuras como <strong>Gerardus Mercator</strong> revolucionaron la proyecci&oacute;n cartogr&aacute;fica con su proyecci&oacute;n cil&iacute;ndrica que, aunque distorsiona las &aacute;reas cerca de los polos, es excepcionalmente &uacute;til para la navegaci&oacute;n al mantener las l&iacute;neas de rumbo constantes. Posteriormente, la invenci&oacute;n del telescopio, el cron&oacute;metro y el desarrollo de la trigonometr&iacute;a permitieron mediciones m&aacute;s exactas y la elaboraci&oacute;n de mapas m&aacute;s detallados y fiables, culminando en el siglo XX con la fotogrametr&iacute;a a&eacute;rea, la teledetecci&oacute;n y finalmente, la era de los Sistemas de Informaci&oacute;n Geogr&aacute;fica (SIG).</p>
        </section>

        <section id="elementos">
            <h2>Elementos fundamentales de un Mapa</h2>
            <ul>
                <li><strong>T&iacute;tulo:</strong> Indica el tema o prop&oacute;sito del mapa.</li>
                <li><strong>Leyenda:</strong> Explica los s&iacute;mbolos y colores utilizados en el mapa.</li>
                <li><strong>Escala:</strong> Muestra la relaci&oacute;n entre la distancia en el mapa y la distancia real.</li>
                <li><strong>Orientaci&oacute;n:</strong> Generalmente indica el Norte para ubicar las direcciones.</li>
                <li><strong>Coordenadas:</strong> Latitud y longitud para ubicar puntos exactos.</li>
                <li><strong>Proyecci&oacute;n:</strong> El m&eacute;todo utilizado para representar una superficie esf&eacute;rica en un plano.</li>
                <li><strong>Marco o Borde:</strong> Delimita el &aacute;rea geogr&aacute;fica representada.</li>
                <li><strong>Etiquetas y Top&oacute;nimos:</strong> Nombres de lugares geogr&aacute;ficos para identificar elementos.</li>
                <li><strong>Fuente de Datos:</strong> Indica la procedencia de la informaci&oacute;n para evaluar su fiabilidad.</li>
                <li><strong>Fecha de Creaci&oacute;n/Actualizaci&oacute;n:</strong> Muestra la vigencia de los datos del mapa.</li>
                <li><strong>Autor/Organizaci&oacute;n Creadora:</strong> Identifica a los responsables de la elaboraci&oacute;n del mapa.</li>
                <li><strong>Gr&iacute;cula o Ret&iacute;cula:</strong> Red de l&iacute;neas (coordenadas) para una localizaci&oacute;n precisa.</li>
                <li><strong>Insertos o Mapas Anexos:</strong> Mapas m&aacute;s pequeños que muestran detalles o contextos adicionales.</li>
                <li><strong>Curvas de Nivel (Isol&iacute;neas):</strong> En mapas topogr&aacute;ficos, conectan puntos de igual altitud para representar el relieve.</li>
                <li><strong>Unidades de Medida:</strong> Especifican las unidades de las magnitudes num&eacute;ricas (ej. km, metros).</li>
            </ul>
        </section>

        <section id="tipos">
            <h2>Tipos de Mapas</h2>
            <div class="map-types">
                <div class="map-type-item">
                    <h3>Mapas Topogr&aacute;ficos</h3>
				<figure>
                    <img src="./img/mapa_topografico.jfif" alt="Mapas Topográficos">
                </figure>
					<p>Muestran las caracter&iacute;sticas f&iacute;sicas y del relieve de la superficie terrestre con gran detalle, incluyendo elevaci&oacute;n (representada mediante curvas de nivel o isol&iacute;neas de igual altitud), r&iacute;os, lagos, mares, glaciares, y vegetaci&oacute;n. Son esenciales para actividades como el monta&ntilde;ismo, la ingenier&iacute;a civil y la planificaci&oacute;n de infraestructura.</p>
                </div>
                <div class="map-type-item">
                    <h3>Mapas Tem&aacute;ticos</h3>
				<figure>
                    <img src="./img/mapa_tematico.jfif" alt="Mapas Temáticos">
					</figure>
					<p>Representan la distribuci&oacute;n espacial de un tema o fen&oacute;meno espec&iacute;fico, destacando patrones o concentraciones. Pueden mostrar la distribuci&oacute;n de la poblaci&oacute;n, el clima, la econom&iacute;a, la geolog&iacute;a, la densidad de especies o los resultados electorales, utilizando diversas simbolog&iacute;as para expresar la informaci&oacute;n.</p>
                </div>
                <div class="map-type-item">
                    <h3>Mapas Pol&iacute;ticos</h3>
				<figure>
                    <img src="./img/mapa_politico.jpg" alt="Mapas Políticos">
				</figure>
					<p>Delimitan las fronteras de pa&iacute;ses, estados, provincias, ciudades y otras divisiones administrativas o jur&iacute;sdiccionales. Su principal prop&oacute;sito es mostrar la organizaci&oacute;n territorial y las relaciones geopol&iacute;ticas. Son ampliamente utilizados en la educaci&oacute;n y para la navegaci&oacute;n general a nivel macro.</p>
                </div>
                <div class="map-type-item">
                    <h3>Mapas de Carreteras/Viales</h3>
				<figure>
                    <img src="./img/mapa_carreteras_viales.jfif" alt="Mapas de Carreteras/Viales">
				</figure>
					<p>Dise&ntilde;ados espec&iacute;ficamente para la navegaci&oacute;n automovil&iacute;stica, mostrando la red de carreteras (autopistas, principales, secundarias), ciudades, puntos de inter&eacute;s relevantes para viajeros, y distancias. Fundamentales para planificar rutas.</p>
                </div>
                <div class="map-type-item">
                    <h3>Planos Urbanos / Mapas de Ciudad</h3>
				<figure>
                    <img src="./img/mapa_planourbano_ciudad.jpg" alt="Planos Urbanos / Mapas de Ciudad">
				</figure>
					<p>Representaciones detalladas de &aacute;reas urbanas, mostrando calles, avenidas, plazas, parques, edificios significativos, y a menudo informaci&oacute;n &uacute;til para el visitante, como ubicaciones de hoteles, museos y transporte p&uacute;blico.</p>
                </div>
                 <div class="map-type-item">
                    <h3>Mapas F&iacute;sicos</h3>
				<figure>
                    <img src="./img/mapa_fisico.jfif" alt="Mapas Físicos">
				</figure>
					<p>Similar a los topogr&aacute;ficos, pero con un enfoque m&aacute;s general en las caracter&iacute;sticas naturales de la Tierra (monta&ntilde;as, valles, r&iacute;os, desiertos), utilizando a menudo colores para representar rangos de elevaci&oacute;n y profundidades.</p>
                </div>
                 <div class="map-type-item">
                    <h3>Mapas Hist&oacute;ricos</h3>
				<figure>
                    <img src="./img/mapa_historico.jfif" alt="Mapas Históricos">
				</figure>
					<p>Representan eventos, condiciones o fronteras pol&iacute;ticas de &eacute;pocas pasadas. Permiten visualizar c&oacute;mo era el mundo en un momento determinado de la historia, mostrando la evoluci&oacute;n de imperios o rutas comerciales antiguas.</p>
                </div>
                 <div class="map-type-item">
                    <h3>Mapas N&aacute;uticos</h3>
				<figure>
                    <img src="./img/mapa_nautico.jfif" alt="Mapas Náuticos">
				</figure>
					<p>Cruciales para la navegaci&oacute;n mar&iacute;tima, muestran profundidades del agua, ayudas a la navegaci&oacute;n (boyas, faros), l&iacute;neas de costa, caracter&iacute;sticas del fondo marino, y peligros. Utilizados por marinos y pescadores.</p>
                </div>
                 <div class="map-type-item">
                    <h3>Cartas Aeron&aacute;uticas</h3>
				<figure>
                    <img src="./img/carta_aeronautica.jpg" alt="Cartas Aeronáuticas">
				</figure>
					<p>Dise&ntilde;adas para la navegaci&oacute;n a&eacute;rea, muestran informaci&oacute;n relevante para pilotos, como aeropuertos, rutas a&eacute;reas, altitudes m&iacute;nimas de seguridad, espacio a&eacute;reo controlado y ayudas a la navegaci&oacute;n.</p>
                </div>
                 <div class="map-type-item">
                    <h3>Mapas Catastrales</h3>
				<figure>
                    <img src="./img/mapa_castastral.jpg" alt="Mapas Catastrales">
				</figure>
					<p>Muestran los l&iacute;mites de las propiedades de la tierra, la numeraci&oacute;n de las parcelas, la ubicaci&oacute;n de edificios y, a menudo, informaci&oacute;n sobre la propiedad y el valor de los terrenos. Esenciales para la gesti&oacute;n de la propiedad y los impuestos.</p>
                </div>
                <div class="map-type-item">
                    <h3>Mapas de Uso del Suelo</h3>
				<figure>
                    <img src="./img/mapa_suelos.jpg" alt="Mapas de Uso del Suelo">
				</figure>
					<p>Representan c&oacute;mo se utiliza el terreno (urbano, agr&iacute;cola, forestal, industrial, recreativo, etc.) o qu&eacute; tipo de vegetaci&oacute;n lo cubre. Son fundamentales para la planificaci&oacute;n territorial y la gesti&oacute;n ambiental.</p>
                </div>
            </div>
        </section>

        <section id="interactivo">
            <h2>Explorando un Mapa Interactivo</h2>
            <p>Haz clic en el bot&oacute;n para ver un mapa interactivo.</p>
            <button id="mostrarMapaBtn">Mostrar Mapa</button>
            <div id="contenedorMapa">
                <p style="text-align: center; font-style: italic; color: #555;">
                    Cargando mapa...
                </p>
            </div>
            <p id="mensajeMapa" style="margin-top: 10px; font-weight: bold;"></p>
        </section>
    </main>

    <footer>
        <p>&copy; 2025 Cartograf&iacute;a: El Mundo en tus Manos</p>
    </footer>

    <script src="js/mi_javascr.js"></script>
</body>
</html>